Res-container-random-v6/container_t_10_c_30_frontCore_4_wrkCore_2/wrk.txt
Running 1m test @ http://128.226.119.92:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 4846.813ms, rate sampling interval: 17940ms
  Thread calibration: mean lat.: 4870.734ms, rate sampling interval: 17940ms
  Thread calibration: mean lat.: 4912.495ms, rate sampling interval: 17956ms
  Thread calibration: mean lat.: 4803.933ms, rate sampling interval: 17891ms
  Thread calibration: mean lat.: 4917.258ms, rate sampling interval: 17956ms
  Thread calibration: mean lat.: 4817.014ms, rate sampling interval: 17743ms
  Thread calibration: mean lat.: 4837.690ms, rate sampling interval: 17842ms
  Thread calibration: mean lat.: 4937.601ms, rate sampling interval: 17924ms
  Thread calibration: mean lat.: 4858.669ms, rate sampling interval: 17776ms
  Thread calibration: mean lat.: 4882.181ms, rate sampling interval: 17973ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    33.23s    13.24s    0.97m    59.40%
    Req/Sec   238.10      2.53   243.00     85.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   33.49s 
 75.000%   43.78s 
 90.000%    0.86m 
 99.000%    0.97m 
 99.900%    0.99m 
 99.990%    0.99m 
 99.999%    0.99m 
100.000%    0.99m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9879.551     0.000000            1         1.00
   14950.399     0.100000        11816         1.11
   19759.103     0.200000        23642         1.25
   24182.783     0.300000        35474         1.43
   29097.983     0.400000        47280         1.67
   33488.895     0.500000        59107         2.00
   35323.903     0.550000        65134         2.22
   37060.607     0.600000        70923         2.50
   39092.223     0.650000        76844         2.86
   41254.911     0.700000        82729         3.33
   43778.047     0.750000        88661         4.00
   45121.535     0.775000        91587         4.44
   46563.327     0.800000        94532         5.00
   47874.047     0.825000        97514         5.71
   49250.303     0.850000       100441         6.67
   50593.791     0.875000       103454         8.00
   51216.383     0.887500       104966         8.89
   51838.975     0.900000       106375        10.00
   52527.103     0.912500       107858        11.43
   53280.767     0.925000       109336        13.33
   53936.127     0.937500       110800        16.00
   54296.575     0.943750       111551        17.78
   54624.255     0.950000       112269        20.00
   55050.239     0.956250       112999        22.86
   55508.991     0.962500       113774        26.67
   55967.743     0.968750       114479        32.00
   56229.887     0.971875       114833        35.56
   56557.567     0.975000       115206        40.00
   56819.711     0.978125       115579        45.71
   57147.391     0.981250       115940        53.33
   57507.839     0.984375       116311        64.00
   57737.215     0.985938       116501        71.11
   57933.823     0.987500       116680        80.00
   58163.199     0.989062       116897        91.43
   58327.039     0.990625       117044       106.67
   58556.415     0.992188       117250       128.00
   58654.719     0.992969       117338       142.22
   58753.023     0.993750       117420       160.00
   58851.327     0.994531       117508       182.86
   58949.631     0.995313       117609       213.33
   59047.935     0.996094       117703       256.00
   59113.471     0.996484       117750       284.44
   59146.239     0.996875       117782       320.00
   59211.775     0.997266       117844       365.71
   59277.311     0.997656       117897       426.67
   59310.079     0.998047       117918       512.00
   59375.615     0.998242       117974       568.89
   59375.615     0.998437       117974       640.00
   59408.383     0.998633       118000       731.43
   59441.151     0.998828       118020       853.33
   59473.919     0.999023       118055      1024.00
   59473.919     0.999121       118055      1137.78
   59506.687     0.999219       118070      1280.00
   59506.687     0.999316       118070      1462.86
   59539.455     0.999414       118086      1706.67
   59572.223     0.999512       118111      2048.00
   59572.223     0.999561       118111      2275.56
   59572.223     0.999609       118111      2560.00
   59572.223     0.999658       118111      2925.71
   59604.991     0.999707       118121      3413.33
   59604.991     0.999756       118121      4096.00
   59637.759     0.999780       118132      4551.11
   59637.759     0.999805       118132      5120.00
   59637.759     0.999829       118132      5851.43
   59637.759     0.999854       118132      6826.67
   59670.527     0.999878       118148      8192.00
   59670.527     1.000000       118148          inf
#[Mean    =    33225.676, StdDeviation   =    13241.696]
#[Max     =    59637.760, Total count    =       118148]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  142671 requests in 1.00m, 59.12MB read
  Socket errors: connect 0, read 0, write 0, timeout 101
Requests/sec:   2376.53
Transfer/sec:      0.98MB